                # Напишите программу, которая:
# Реализует функцию check_triangle(a, b, c),
# которая принимает три числа (длины сторон треугольника) и проверяет, можно ли из них построить треугольник.
# Условие существования треугольника: каждая сторона должна быть меньше суммы двух других.
# Если треугольник можно построить, программа должна определить его тип:
# Равносторонний, равнобедренный или разносторонний.
                # Пример работы программы:
# Введите длину первой стороны: 3
# Введите длину второй стороны: 4
# Введите длину третьей стороны: 5
# Результат: Треугольник разносторонний.
def check_triangle(a, b, c):
